name: "rubert_preprocess"
backend: "python"
max_batch_size: 512

input [
  {
    name: "TEXT"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "INPUT_IDS"
    data_type: TYPE_INT32
    dims: [16]
  },
  {
    name: "ATTENTION_MASK"
    data_type: TYPE_INT64
    dims: [16]
  }
]
