name: "rubert_ensemble"
platform: "ensemble"
max_batch_size: 512

input [
  {
    name: "TEXT"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "EMBEDDINGS"
    data_type: TYPE_FP32
    dims: [32]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "rubert_preprocess"
      model_version: -1
      input_map {
        key: "TEXT"
        value: "TEXT"
      }
      output_map {
        key: "INPUT_IDS"
        value: "INPUT_IDS"
      }
      output_map {
        key: "ATTENTION_MASK"
        value: "ATTENTION_MASK"
      }
    },
    {
      model_name: "rubert_onnx"
      model_version: -1
      input_map {
        key: "INPUT_IDS"
        value: "INPUT_IDS"
      }
      input_map {
        key: "ATTENTION_MASK"
        value: "ATTENTION_MASK"
      }
      output_map {
        key: "EMBEDDINGS"
        value: "EMBEDDINGS"
      }
    }
  ]
}
